## Funciones principales

In [ ]:
# Imports
import pandas as pd
import numpy as np

### Creando series

In [ ]:

import pandas as pd
s = pd.Series(['Matemáticas', 'Historia', 'Economía', 'Programación', 'Inglés'], dtype='string')
print(s)

0     Matemáticas
1        Historia
2        Economía
3    Programación
4          Inglés
dtype: string

In [ ]:
import pandas as pd
s = pd.Series({'Matemáticas': 6.0,  'Economía': 4.5, 'Programación': 8.5})
print(s)

Matemáticas     6.0
Economía        4.5
Programación    8.5
dtype: float64

### Atributos de una serie

In [ ]:
s = pd.Series([1, 2, 2, 3, 3, 3, 4, 4, 4, 4])

print(s.size)
print(s.index)
print(s.dtype)

### Accediendo a los datos de una serie

In [ ]:
s = pd.Series({'Matemáticas': 6.0,  'Economía': 4.5, 'Programación': 8.5})

print(s[1:3])
# Economía        4.5
# Programación    8.5
# dtype: float64

print(s['Economía'])
#4.5

print(s[['Programación', 'Matemáticas']])
# Programación    8.5
# Matemáticas     6.0
# dtype: float64

Economía        4.5
Programación    8.5
dtype: float64
4.5
Programación    8.5
Matemáticas     6.0
dtype: float64

### Operaciones con series

In [ ]:

s = pd.Series([1, 2, 3, 4])
print(s * 2)
# 0    2
# 1    4
# 2    6
# 3    8
# dtype: int64

print(s % 2)
# 0    1
# 1    0
# 2    1
# 3    0
# dtype: int64

s = pd.Series(['a', 'b', 'c'])
print(s * 5)
# 0    aaaaa
# 1    bbbbb
# 2    ccccc
# dtype: object

In [ ]:
import pandas as pd
from math import log

s = pd.Series([1, 2, 3, 4])
print(s.apply(log))
# 0    0.000000
# 1    0.693147
# 2    1.098612
# 3    1.386294
# dtype: float64

s = pd.Series(['a', 'b', 'c'])
print(s.apply(str.upper))
# 0    A
# 1    B
# 2    C
# dtype: object

### Filtrar elementos de una serie

In [ ]:
s = pd.Series({'Matemáticas': 6.0,  'Economía': 4.5, 'Programación': 8.5})
print(s[s > 5])
# Matemáticas     6.0
# Programación    8.5
# dtype: float64

### Ordenar una serie

In [ ]:
s = pd.Series({'Matemáticas': 6.0,  'Economía': 4.5, 'Programación': 8.5})

print(s.sort_values())
# Economía        4.5
# Matemáticas     6.0
# Programación    8.5
# dtype: float64

print(s.sort_index(ascending = False))
# Programación    8.5
# Matemáticas     6.0
# Economía        4.5
# dtype: float64

### Crear un DataFrame

In [ ]:
datos = {'nombre':['María', 'Luis', 'Carmen', 'Antonio'],
         'edad':[18, 22, 20, 21],
         'grado':['Economía', 'Medicina', 'Arquitectura', 'Economía'],
         'correo':['maria@gmail.com', 'luis@yahoo.es', 'carmen@gmail.com', 'antonio@gmail.com']
         }
df = pd.DataFrame(datos)
print(df)
#     nombre  edad         grado             correo
# 0    María    18      Economía    maria@gmail.com
# 1     Luis    22      Medicina      luis@yahoo.es
# 2   Carmen    20  Arquitectura   carmen@gmail.com
# 3  Antonio    21      Economía  antonio@gmail.com

    nombre  edad         grado             correo
0    María    18      Economía    maria@gmail.com
1     Luis    22      Medicina      luis@yahoo.es
2   Carmen    20  Arquitectura   carmen@gmail.com
3  Antonio    21      Economía  antonio@gmail.com

In [ ]:
df = pd.DataFrame([['María', 18], ['Luis', 22], ['Carmen', 20]], columns=['Nombre', 'Edad'])
print(df)
#    Nombre   Edad
# 0   María     18
# 1    Luis     22
# 2  Carmen     20

In [ ]:
df = pd.DataFrame(np.random.randn(4, 3), columns=['a', 'b', 'c'])
print(df)
#           a         b         c
# 0 -1.408238  0.644706  1.077434
# 1 -0.279264 -0.249229  1.019137
# 2 -0.805470 -0.629498  0.935066
# 3  0.236936 -0.431673 -0.177379

### Importar y exportar ficheros

In [ ]:
df = pd.read_csv(
'https://raw.githubusercontent.com/asalber/manual-python/master/datos/colesteroles.csv', sep=';', decimal=',')
print(df.head())
#                               nombre  edad sexo    peso    altura  colesterol
# 0       José Luis Martínez Izquierdo    18    H    85.0    1.79         182.0
# 1                     Rosa Díaz Díaz    32    M    65.0    1.73         232.0
# 2              Javier García Sánchez    24    H     NaN    1.81         191.0
# 3                Carmen López Pinzón    35    M    65.0    1.70         200.0
# 4               Marisa López Collado    46    M    51.0    1.58         148.0

                         nombre  edad sexo  peso  altura  colesterol
0  José Luis Martínez Izquierdo    18    H  85.0    1.79       182.0
1                Rosa Díaz Díaz    32    M  65.0    1.73       232.0
2         Javier García Sánchez    24    H   NaN    1.81       191.0
3           Carmen López Pinzón    35    M  65.0    1.70       200.0
4          Marisa López Collado    46    M  51.0    1.58       148.0

### Atributos de un DataFrame

In [ ]:
print(df.info())

print(df.shape)

print(df.size)

print(df.columns)

print(df.index)

print(df.dtypes)

print(df.head(5))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   nombre      14 non-null     object
 1   edad        14 non-null     int64
 2   sexo        14 non-null     object
 3   peso        13 non-null     float64
 4   altura      14 non-null     float64
 5   colesterol  13 non-null     float64
dtypes: float64(3), int64(1), object(2)
memory usage: 800.0+ bytes
None
(14, 6)
84
Index(['nombre', 'edad', 'sexo', 'peso', 'altura', 'colesterol'], dtype='object')
RangeIndex(start=0, stop=14, step=1)
nombre         object
edad            int64
sexo           object
peso          float64
altura        float64
colesterol    float64
dtype: object
                         nombre  edad sexo  peso  altura  colesterol
0  José Luis Martínez Izquierdo    18    H  85.0    1.79       182.0
1                Rosa Díaz Díaz    32    M  65.0    1.73       232.0
2         Javier García Sánchez    24    H   NaN    1.81       191.0
3           Carmen López Pinzón    35    M  65.0    1.70       200.0
4          Marisa López Collado    46    M  51.0    1.58       148.0

### Renombrar columnas y filas

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/asalber/manual-python/master/datos/colesterol.csv')


print(df.rename(columns={'nombre':'nombre y apellidos', 'altura':'estatura'}, index={0:1000, 1:1001, 2:1002}))

                   nombre y apellidos  edad sexo   peso  estatura  colesterol
1000     José Luis Martínez Izquierdo    18    H   85.0      1.79       182.0
1001                   Rosa Díaz Díaz    32    M   65.0      1.73       232.0
1002            Javier García Sánchez    24    H    NaN      1.81       191.0
3                 Carmen López Pinzón    35    M   65.0      1.70       200.0
4                Marisa López Collado    46    M   51.0      1.58       148.0
5                   Antonio Ruiz Cruz    68    H   66.0      1.74       249.0
6             Antonio Fernández Ocaña    51    H   62.0      1.72       276.0
7               Pilar Martín González    22    M   60.0      1.66         NaN
8                Pedro Gálvez Tenorio    35    H   90.0      1.94       241.0
9             Santiago Reillo Manzano    46    H   75.0      1.85       280.0
10              Macarena Álvarez Luna    53    M   55.0      1.62       262.0
11         José María de la Guía Sanz    58    H   78.0      1.87       198.0
12    Miguel Angel Cuadrado Gutiérrez    27    H  109.0      1.98       210.0
13              Carolina Rubio Moreno    20    M   61.0      1.77       194.0

### Acceder a datos de un DataFrame

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/asalber/manual-python/master/datos/colesterol.csv')
print(df)

print(df.iloc[1, 3])
# 65

print(df.iloc[1, :2])
# nombre     Rosa Díaz Díaz
# edad                   32

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0
65.0
nombre    Rosa Díaz Díaz
edad                  32
Name: 1, dtype: object

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/asalber/manual-python/master/datos/colesterol.csv')
print(df.loc[2, 'colesterol'])
# 191

print(df.loc[:3, ('colesterol','peso')])
#      colesterol    peso
# 1         232.0    65.0
# 2         191.0     NaN
# 3         200.0    65.0
print(df['colesterol'])
# 0     182.0
# 1     232.0
# 2     191.0
# 3     200.0

print(df[['colesterol','peso']])

191.0
   colesterol  peso
0       182.0  85.0
1       232.0  65.0
2       191.0   NaN
3       200.0  65.0
0     182.0
1     232.0
2     191.0
3     200.0
4     148.0
5     249.0
6     276.0
7       NaN
8     241.0
9     280.0
10    262.0
11    198.0
12    210.0
13    194.0
Name: colesterol, dtype: float64
    colesterol   peso
0        182.0   85.0
1        232.0   65.0
2        191.0    NaN
3        200.0   65.0
4        148.0   51.0
5        249.0   66.0
6        276.0   62.0
7          NaN   60.0
8        241.0   90.0
9        280.0   75.0
10       262.0   55.0
11       198.0   78.0
12       210.0  109.0
13       194.0   61.0

### Añadir columnas a un DataFrame

In [ ]:
df['diabetes3'] = pd.Series([])
print(df)

                             nombre  edad sexo   peso  altura  colesterol  \
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

   diabetes diabetes2  diabetes3
0     False     False        NaN
1     False     False        NaN
2      True      True        NaN
3     False     False        NaN
4      True      True        NaN
5       NaN       NaN        NaN
6       NaN       NaN        NaN
7       NaN       NaN        NaN
8       NaN       NaN        NaN
9       NaN       NaN        NaN
10      NaN       NaN        NaN
11      NaN       NaN        NaN
12      NaN       NaN        NaN
13      NaN       NaN        NaN

<ipython-input-12-f24cd5bc7b70>:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  df['diabetes3'] = pd.Series([])

In [ ]:
# Crear un DataFrame de ejemplo
data = {'Nombre': ['Juan', 'María', 'Pedro'],
        'Edad': [25, 30, 35]}
df = pd.DataFrame(data)

# Agregar una nueva columna al DataFrame
df['Profesión2'] = ['Ingeniero', 'Abogada', 'Doctor']

## Esto saldra error
## df['Profesión2'] = ['Ingeniero', 'Abogada']

print(df)

  Nombre  Edad Profesión2
0   Juan    25  Ingeniero
1  María    30    Abogada
2  Pedro    35     Doctor

### Operaciones sobre columnas

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/asalber/manual-python/master/datos/colesterol.csv')

df['new_altura'] = df['altura']*100

df['sexo_M'] = df['sexo']=='M'
print(df)

                             nombre  edad sexo   peso  altura  colesterol  \
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

    new_altura  sexo_M
0        179.0   False
1        173.0    True
2        181.0   False
3        170.0    True
4        158.0    True
5        174.0   False
6        172.0   False
7        166.0    True
8        194.0   False
9        185.0   False
10       162.0    True
11       187.0   False
12       198.0   False
13       177.0    True

In [ ]:
from math import log
df = pd.read_csv('https://raw.githubusercontent.com/asalber/manual-python/master/datos/colesterol.csv')

df['log altura'] = df['altura'].apply(log)
print(df)

                             nombre  edad sexo   peso  altura  colesterol  \
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

    log altura
0     0.582216
1     0.548121
2     0.593327
3     0.530628
4     0.457425
5     0.553885
6     0.542324
7     0.506818
8     0.662688
9     0.615186
10    0.482426
11    0.625938
12    0.683097
13    0.570980

In [ ]:
df = pd.DataFrame({'Name': ['María', 'Carlos', 'Carmen'], 'Nacimiento':['05-03-2000', '20-05-2001', '10-12-1999']})

print(pd.to_datetime(df.Nacimiento, format = '%d-%m-%Y'))

0   2000-03-05
1   2001-05-20
2   1999-12-10
Name: Nacimiento, dtype: datetime64[ns]

### Resumen descriptivo

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/asalber/manual-python/master/datos/colesterol.csv')

print(df.count())

print(df.sum())

print(df.max())

print(df.mean())

print(df.describe())

### Eliminar columnas de un DataFrame

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/asalber/manual-python/master/datos/colesterol.csv')
print(df)
edad = df.pop('edad')
print(df)

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0
                             nombre sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    M   65.0    1.73       232.0
2             Javier García Sánchez    H    NaN    1.81       191.0
3               Carmen López Pinzón    M   65.0    1.70       200.0
4              Marisa López Collado    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    H   62.0    1.72       276.0
7             Pilar Martín González    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    M   55.0    1.62       262.0
11       José María de la Guía Sanz    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    M   61.0    1.77       194.0

### Añadir una fila a un DataFrame

In [ ]:
# Crear un DataFrame de ejemplo
data = {'Nombre': ['Juan', 'María', 'Pedro'],
        'Edad': [25, 30, 35]}
df = pd.DataFrame(data)

# Crear una nueva fila como un diccionario
nueva_fila = {'Nombre': 'Luisa', 'Edad': 28}

# Agregar la nueva fila al DataFrame utilizando append()
df = df.append(nueva_fila, ignore_index=True)

print(df)

  Nombre  Edad
0   Juan    25
1  María    30
2  Pedro    35
3  Luisa    28

<ipython-input-27-45b821c4e72f>:10: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(nueva_fila, ignore_index=True)

In [ ]:
import pandas as pd

# Crear un DataFrame de ejemplo
data = {'Nombre': ['Juan', 'María', 'Pedro'],
        'Edad': [25, 30, 35]}
df = pd.DataFrame(data)

# Crear una nueva fila como un DataFrame separado
nueva_fila = pd.DataFrame({'Nombre': ['Luisa'], 'Edad': [28]})

# Concatenar el DataFrame original con la nueva fila utilizando concat()
df = pd.concat([df, nueva_fila], ignore_index=True)

print(df)

nueva_fila = pd.DataFrame({'Nombre': ['Luisa','Ernie'], 'Edad': [28,30]})

# Concatenar el DataFrame original con la nueva fila utilizando concat()
df = pd.concat([df, nueva_fila], ignore_index=True)

print(df)

  Nombre  Edad
0   Juan    25
1  María    30
2  Pedro    35
3  Luisa    28
  Nombre  Edad
0   Juan    25
1  María    30
2  Pedro    35
3  Luisa    28
4  Luisa    28
5  Ernie    30

### Eliminar filas de un DataFrame

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/asalber/manual-python/master/datos/colesterol.csv')

print(df)

df = df.drop([1,3])
print(df)

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0
                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

### Filtrar filas de un DataFrame

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/asalber/manual-python/master/datos/colesterol.csv')

df_filtrado_1 = df[df['sexo']=='H']
print(df_filtrado_1)

df_filtrado_2 = df[(df['sexo']=='H') & (df['colesterol'] > 260)]
print(df_filtrado_2)

### Ordenar un DataFrame

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/asalber/manual-python/master/datos/colesterol.csv')
print(df.sort_values('colesterol'))

                             nombre  edad sexo   peso  altura  colesterol
4              Marisa López Collado    46    M   51.0    1.58       148.0
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
7             Pilar Martín González    22    M   60.0    1.66         NaN

### Limpiar NaN en un DataFrame

In [ ]:
data = {'A': [1, np.nan, 3, 4],
        'B': [5, 6, np.nan, 8],
        'C': [9, 10, 11, 12]}

df = pd.DataFrame(data)

# Eliminar columnas con al menos un valor faltante (any)
df_without_na_columns = df.dropna(axis=1)

print(df_without_na_columns)

In [ ]:
data = {'A': [1, np.nan, 3, 4],
        'B': [5, 6, np.nan, 8],
        'C': [9, 10, 11, 12]}

df = pd.DataFrame(data)

# Eliminar filas con al menos un valor faltante (any)
df_without_na_rows = df.dropna(axis=0)

print(df_without_na_rows)

In [ ]:
data = {'A': [1, np.nan, 3, 4],
        'B': [5, 6, np.nan, 8],
        'C': [9, 10, 11, 12]}

df = pd.DataFrame(data)

# Eliminar columnas con todos los valores faltantes (all)
df_without_all_na_columns = df.dropna(axis=1, how='all')

print(df_without_all_na_columns)

In [ ]:
data = {'A': [1, np.nan, 3, 4],
        'B': [5, 6, np.nan, 8],
        'C': [9, 10, 11, 12]}

df = pd.DataFrame(data)

# Eliminar filas con todos los valores faltantes (all)
df_without_all_na_rows = df.dropna(axis=0, how='all')

print(df_without_all_na_rows)

### Agrupar datos de un DataFrame

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/asalber/manual-python/master/datos/colesterol.csv')

print(df)
print(df.groupby('sexo').groups)

grupo1 = df.groupby('sexo').groups['H']
print(df.iloc[grupo1])

grupo1 = df.groupby('sexo').groups['H']
print(df.iloc[grupo1])

print(df.groupby('sexo').get_group('M'))

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0
{'H': [0, 2, 5, 6, 8, 9, 11, 12], 'M': [1, 3, 4, 7, 10, 13]}
                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
                   nombre  edad sexo  peso  altura  colesterol
1          Rosa Díaz Díaz    32    M  65.0    1.73       232.0
3     Carmen López Pinzón    35    M  65.0    1.70       200.0
4    Marisa López Collado    46    M  51.0    1.58       148.0
7   Pilar Martín González    22    M  60.0    1.66         NaN
10  Macarena Álvarez Luna    53    M  55.0    1.62       262.0
13  Carolina Rubio Moreno    20    M  61.0    1.77       194.0

### Concatenacion de un DataFrame

In [ ]:
data1 = {'A': [1, 2, 3],
         'B': [4, 5, 6]}
df1 = pd.DataFrame(data1)

data2 = {'A': [7, 8, 9],
         'B': [10, 11, 12]}
df2 = pd.DataFrame(data2)

print("DataFrame 1:")
print(df1)
print()
print("DataFrame 2:")
print(df2)

# Concatenar los DataFrames verticalmente (por filas)
concatenated_df = pd.concat([df1, df2], ignore_index=True)

print("DataFrame concatenado:")
print(concatenated_df)

DataFrame 1:
   A  B
0  1  4
1  2  5
2  3  6

DataFrame 2:
   A   B
0  7  10
1  8  11
2  9  12
DataFrame concatenado:
   A   B
0  1   4
1  2   5
2  3   6
3  7  10
4  8  11
5  9  12

### Mezclar DataFrames

In [ ]:
data1 = {'ID': [1, 2, 3, 4],
         'Nombre': ['Juan', 'María', 'Pedro', 'Ana']}
df1 = pd.DataFrame(data1)

data2 = {'ID': [3, 4, 5, 6],
         'Edad': [25, 30, 35, 40]}
df2 = pd.DataFrame(data2)

print("DataFrame 1:")
print(df1)
print()
print("DataFrame 2:")
print(df2)

DataFrame 1:
   ID Nombre
0   1   Juan
1   2  María
2   3  Pedro
3   4    Ana

DataFrame 2:
   ID  Edad
0   3    25
1   4    30
2   5    35
3   6    40

In [ ]:
# Realizar un Inner Merge en la columna 'ID'
inner_merge = df1.merge(df2, on='ID', how='inner')

print("Inner Merge:")
print(inner_merge)

Inner Merge:
   ID Nombre  Edad
0   3  Pedro    25
1   4    Ana    30

In [ ]:
# Realizar un Left Merge en la columna 'ID'
left_merge = df1.merge(df2, on='ID', how='left')

print("Left Merge:")
print(left_merge)

Left Merge:
   ID Nombre  Edad
0   1   Juan   NaN
1   2  María   NaN
2   3  Pedro  25.0
3   4    Ana  30.0

In [ ]:
# Realizar un Right Merge en la columna 'ID'
right_merge = df1.merge(df2, on='ID', how='right')

print("Right Merge:")
print(right_merge)

Right Merge:
   ID Nombre  Edad
0   3  Pedro    25
1   4    Ana    30
2   5    NaN    35
3   6    NaN    40

# Analisis de datos

### Uso de m

# Ejercicios

### Cargar los archivos y ver su dimension

In [ ]:
transactions    = pd.read_csv('sales_train.csv')

### Ejercicio 1 : Imprimir el tamaño de los dataframes cargados y los primeros 10 valores de cada uno.

In [ ]:
print('shape of transactions:    {}'.format(transactions.shape))

shape of transactions:    (2935849, 6)
shape of items:           (22170, 3)
shape of item_categories: (84, 2)
shape of shops:           (60, 2)

In [ ]:
transactions.head(5)
### Lo mismo para los otros dataframes

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

### Ejercicio 2:
Usando pandas , responde a la siguiente pregunta:  ¿Cuál fue el ingreso total en septiembre de 2014?

En adelante, los ingresos se refieren a las ventas totales menos el valor de los bienes devueltos.

Sugerencias:

Es útil dividir el campo de fecha en componentes [día, mes, año] y usar df.year == 14 y df.month == 9 para seleccionar el subconjunto objetivo de fechas.
Puede trabajar con la función de fecha como el tipo pd.datetime con la función pd.to_datetime, pero no olvide establecer el argumento de formato correcto.

In [ ]:
transactions['date']= pd.to_datetime(transactions['date'], format='%d.%m.%Y')
transactions['Dia'] = transactions['date'].dt.day
transactions['Mes'] = transactions['date'].dt.month
transactions['Año'] = transactions['date'].dt.year
transactions.head()

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,Dia,Mes,Año
0,2013-01-02,0,59,22154,999.00,1.0,2,1,2013
1,2013-01-03,0,25,2552,899.00,1.0,3,1,2013
2,2013-01-05,0,25,2552,899.00,-1.0,5,1,2013
3,2013-01-06,0,25,2554,1709.05,1.0,6,1,2013
4,2013-01-15,0,25,2555,1099.00,1.0,15,1,2013

In [ ]:
transactions['ingresos'] = transactions['item_price'] * transactions['item_cnt_day']

transactions_selected = transactions[ (transactions['Año']==2014) & (transactions['Mes']==9)]

transactions_sum = transactions_selected['ingresos'].sum()
print(transactions_sum)

114723593.9699982

### Ejercicio 3:
Usando pandas , responde a la siguiente pregunta:  ¿Cuál fue el ingreso total máximo entre todas las tiendas en septiembre de 2014?

In [ ]:
tiendas_ingresos = transactions_selected.groupby('shop_id')['ingresos'].sum().max()
print(tiendas_ingresos)

7982852.199999957

### Ejercicio 4:
Imprime los precios distintos (unicos) que tiene cada item. Usar todos los periodos de tiempo.

Pista: Usar la funcion .nunique() . Cuenta los valores unicos.

In [ ]:
unique_prices = transactions.groupby('item_id')['item_price'].nunique()
unique_prices.head(10)

item_id
0    1
1    1
2    1
3    2
4    1
5    1
6    1
7    1
8    1
9    1
Name: item_price, dtype: int64

### Ejercicio 5:
¿Cuántos artículos hay, de modo que su precio permanezca constante. Usar todos los periodos de tiempo?

In [ ]:
num_items_constant_price = unique_prices[unique_prices==1].shape[0]
print(num_items_constant_price)

5926

###Ejercicio 6

Usando pandas , responde a la siguiente pregunta:  ¿Cuáles fueron las ventas totales (sin contar las devoluciones)  en enero de 2013?

###Ejercicio 7

Carga el archivo titanic.csv y responde las siguientes preguntas :

- Mostrar por pantalla el hombre y mujeres (por separado) que sobrevivieron y murieron.

- Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase.

In [ ]:
df_titanic    = pd.read_csv('titanic.csv')